# IdeaStatiCa.RcsApi.Model.WeldData
Provides data of the single weld

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**Id** | **int** | Id of the weld | [optional]
**Name** | **string** | Name of the weld | [optional]
**Thickness** | **double** | Thickness of the weld | [optional]
**Material** | **string** | Name of the material | [optional]
**WeldMaterial** | **ReferenceElement** |  | [optional]
**WeldType** | **WeldType** |  | [optional]
**ConnectedPartIds** | **List&lt;string&gt;** | Id of the weld | [optional]
**Start** | **Point3D** |  | [optional]
**End** | **Point3D** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)